import classes from "./Info.module.css";
const Info = () => {
  return (
    <div className={classes.container}>
      <p>
        طراحی وب به مهارت ساخت و راه‌اندازی صفحات وب گفته می‌شود. تیم برنرز لی،
        مخترع وب، با برپایی یک سایت وب در اوت ۱۹۹۱، نام خود را به عنوان نخستین
        سازندهٔ وب در تاریخ نگاشت. او در نخستین وب سایتش، از اَبَرمتن و پیوندی
        برای ایمیل (پست الکترونیک) استفاده کرده بود.
      </p>
      <p>
        {" "}
        در آغاز، وب سایت‌ها با کُدهای ساده HTML نوشته می‌شدند، گونه‌ای از زبان
        نشانه‌گذاری که ساختار ساده‌ای به وب گاه‌ها می‌داد، شامل سرتیتر و
        پاراگراف، و توانایی پیوند دادن به آدرس‌های دیگر از طریق ابرپیوند. در
        مقایسه با روش‌های دیگر، این راه تازه و متفاوتی بود که کاربران به سادگی
        می‌توانستند با یک مرورگر، صفحه‌های پیوند خورده را باز کنند.
      </p>
      <p>
        {" "}
        با پیشرفت وب و هنر طراحی آن، زبان کُدنویسی اش، اَبَرمتن یا اچ تی ام‌ال،
        پیچیده‌تر و پرانعطاف تر شد. ابزاری مانند جدول‌ها که بیشتر برای نمایش
        نمودارهای داده‌ای بودند، بزودی مورد استفاده نادرست، برای چیدمان‌های
        پنهان در صفحه‌های وب قرار گرفتند. با پیدایش الگوهای آبشاری وب یا «CSS»،
        روش نادرست طراحی با جدول‌های پنهان در صفحه از گردونه خارج، و به جای آن
        استفاده مناسب از زبان کمکی «CSS» جایگزین شد.
      </p>
      <p>
        {" "}
        فناوری‌های یکپارچه‌سازی پایگاه داده (Database)، مانند زبان‌های کُدنویسی
        سمت سرور (Server-Side Scripting) مانند CGI، PHP، ASP. NET، ASP، JSP و
        ColdFusion، و استانداردهای طراحی مدرن با الگوها (CSS)، ساختار وب سایت‌ها
        را باز هم تغییر داده و آن را پیشرفته تر کرده‌اند.
      </p>
      <p>
        {" "}
        سایت واکنش گرا یا سایت ریسپانسیو (responsive) سایتی است که با ابعاد و
        رزولوشن دستگاه‌های مختلف سازگاری دارد و کاربران بدون توجه به اینکه صفحه
        نمایش دستگاه شان کوچک باشد. همچنین با آمدن نگاره‌های جاندار و فناوری‌های
        پویانمایی به صفحه‌ها، مانند فلَش (Flash)، چهره وب بیشتر از پیش تغییر کرد
        و توانمندی‌های تازه به سازندگان رسانه و طراح‌های وب داده شد.
      </p>
      <span> طراحی سایت چیست : منبع: ویکی پدیا</span>
    </div>
  );
};

export default Info;
